### Terraform Plan: `nrds-cfe-nom` ✅

**Plan: 632 to add, 0 to change, 0 to destroy.**

<details><summary>Show Plan Details</summary>

```terraform
  # module.schedules.aws_scheduler_schedule.datastream_schedule_short_range_cfe_nom["23_11"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_cfe_nom" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu11_schedule_cfe_nom_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # module.schedules.aws_scheduler_schedule.datastream_schedule_short_range_cfe_nom["23_12"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_cfe_nom" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu12_schedule_cfe_nom_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # module.schedules.aws_scheduler_schedule.datastream_schedule_short_range_cfe_nom["23_13"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_cfe_nom" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu13_schedule_cfe_nom_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # module.schedules.aws_scheduler_schedule.datastream_schedule_short_range_cfe_nom["23_14"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_cfe_nom" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu14_schedule_cfe_nom_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # module.schedules.aws_scheduler_schedule.datastream_schedule_short_range_cfe_nom["23_15"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_cfe_nom" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu15_schedule_cfe_nom_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # module.schedules.aws_scheduler_schedule.datastream_schedule_short_range_cfe_nom["23_16"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_cfe_nom" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu16_schedule_cfe_nom_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # module.schedules.aws_scheduler_schedule.datastream_schedule_short_range_cfe_nom["23_17"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_cfe_nom" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu17_schedule_cfe_nom_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # module.schedules.aws_scheduler_schedule.datastream_schedule_short_range_cfe_nom["23_18"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_cfe_nom" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_vpu18_schedule_cfe_nom_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 0 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

Plan: 632 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + analysis_assim_schedule_count = 21
  + datastream_arn                = (known after apply)
  + ec2_security_group_id         = (known after apply)
  + lambda_arns                   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + lambda_function_names         = [
      + "nrds_cfe_nom_prod_start_ec2",
      + "nrds_cfe_nom_prod_ec2_commander",
      + "nrds_cfe_nom_prod_ec2_command_poller",
      + "nrds_cfe_nom_prod_s3_object_checker",
      + "nrds_cfe_nom_prod_ec2_stopper",
    ]
  + lambda_role_arn               = (known after apply)
  + medium_range_schedule_count   = 84
  + short_range_schedule_count    = 504

```

</details>

*Pusher: @harshavemula-ua, Action: `pull_request`, Workflow: `Terraform PR Validation`*